## Customers

In [60]:
import pandas as pd 

df = pd.read_csv("../Database/customers.csv", sep=",", encoding='Latin-1')
df.head(3)

,CUSTOMERNAME,PHONE,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,id
0,Land of Toys Inc.,2125557818,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,1
1,Reims Collectables,26.47.1555,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,2
2,Lyon Souveniers,+33 1 46 62 7555,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,3

In [61]:
df.isnull().sum().sort_values(ascending=False)

ADDRESSLINE2        83
STATE               46
TERRITORY           38
POSTALCODE           3
CUSTOMERNAME         0
PHONE                0
ADDRESSLINE1         0
CITY                 0
COUNTRY              0
CONTACTLASTNAME      0
CONTACTFIRSTNAME     0
id                   0
dtype: int64

In [62]:
null_columns = ['ADDRESSLINE2', 'STATE', 'TERRITORY', 'POSTALCODE']

### Kayıp Veri Stratejisi

Müşterilere ilişkin kayıp verileri klasik fill metotlarından olan ortalama, medyan, most_freq gibi değerler ile doldurmak hatalı olacaktır. Zira her müşterinin adres verileri farklı olacaktır. Bu nedenle özel bir strateji belirlemeye gerek yoktur, kayıp verileri "Bilinmiyor" olarak doldurabiliriz.

In [63]:
for i in null_columns:
    df[i].fillna('Bilinmiyor', inplace=True)

/var/folders/pc/qcs13wm520n7k8hkn2_m0hl40000gn/T/ipykernel_50671/318528477.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[i].fillna('Bilinmiyor', inplace=True)

In [64]:
df.isnull().sum().sum()

0

In [65]:
df.to_csv("../Database/customers.csv", sep=",", encoding='Latin-1', index=False)

## Products

In [66]:
df = pd.read_csv("../Database/products.csv", sep=",", encoding='Latin-1')
df.head(3)

  PRODUCTCODE   PRODUCTLINE  MSRP
0    S10_1678   Motorcycles    95
1    S10_1949  Classic Cars   214
2    S10_2016   Motorcycles   118

In [67]:
df.isnull().sum()

PRODUCTCODE    0
PRODUCTLINE    0
MSRP           0
dtype: int64

## Orders

In [68]:
df = pd.read_csv("../Database/orders.csv", sep=",", encoding='Latin-1')
df.head(3)

,ORDERNUMBER,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,DEALSIZE,customer_id
0,10107,2/24/2003 0:00,Shipped,1,2,2003,Small,1
1,10121,5/7/2003 0:00,Shipped,2,5,2003,Small,2
2,10134,7/1/2003 0:00,Shipped,3,7,2003,Medium,3

In [69]:
df.isnull().sum()

ORDERNUMBER    0
ORDERDATE      0
STATUS         0
QTR_ID         0
MONTH_ID       0
YEAR_ID        0
DEALSIZE       0
customer_id    0
dtype: int64

## Order Items

In [70]:
df = pd.read_csv("../Database/order_items.csv", sep=",", encoding='Latin-1')
df.head(3)

,ORDERNUMBER,PRODUCTCODE,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES
0,10107,S10_1678,30,95.70,2,2871.00
1,10121,S10_1678,34,81.35,5,2765.90
2,10134,S10_1678,41,94.74,2,3884.34

In [71]:
df.isnull().sum()

ORDERNUMBER        0
PRODUCTCODE        0
QUANTITYORDERED    0
PRICEEACH          0
ORDERLINENUMBER    0
SALES              0
dtype: int64